# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# Пример: для k = 8 список будет выглядеть так:
# [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]


# def fib(n):
#     if n in (1, 2):
#         return 1
#     return fib(n - 1) + fib(n - 2)


# print(fib(8))


# n = 8
# f1 = 1
# f2 = 1
# fn = (n-1) + (n-2)
# print(fn)


# exit()
f1 = 1
f2 = 1
n = 10  # int(input())
print(f1, f2, end=' ')
for i in range(2, n):
    f1, f2 = f2, f1 + f2
    print(f2, end=' ')
